app/controllers/expenses_controller.rb

SELECT "expenses".* FROM "expenses" WHERE (strftime('%Y-%m', date) = 'May') ORDER BY "expenses"."date" DESC
SELECT "expenses".* FROM "expenses" ORDER BY "expenses"."date" DESC
SELECT "expenses".* FROM "expenses" WHERE (strftime('%m', date) = 'February') ORDER BY "expenses"."date" DESC
---
  def index
    if params[:month]
      #@expenses = Expense.where('extract(month from date) = ?', Date::MONTHNAMES.index(params[:month]))
      @expenses = Expense.where("strftime('%m', date) = ?", Date::MONTHNAMES.index(params[:month]).to_s.rjust(2, '0'))
    else
      @expenses = Expense.all
    end
    @months = Date.today.all_year.map { |date| date.strftime("%B") }.uniq
    @expense_by_month = @expenses.group_by { |expense| expense.date.strftime('%Y-%m') }
    @expense_by_day = @expenses.order(date: :desc).group_by { |expense| expense.date.strftime('%A, %d %B') }

INSERT INTO "expenses" ("name", "date", "amount", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["name", "www"], ["date", "2024-07-30"], ["amount", 10.0], ["description", "www"], ["created_at", "2024-01-02 17:17:43.150374"], ["updated_at", "2024-01-02 17:17:43.150374"]]
---
  def create
    @expense = Expense.new(expense_params)

    respond_to do |format|
      if @expense.save

UPDATE "expenses" SET "description" = ?, "updated_at" = ? WHERE "expenses"."id" = ?  [["description", "Super 140 GB 120 EGP /month WE SPACE"], ["updated_at", "2024-01-02 09:50:28.088705"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @expense.update(expense_params)

DELETE FROM "expenses" WHERE "expenses"."id" = ?  [["id", 2]]
---
  def destroy
    @expense.destroy!